01  WS-AREA-1 PIC 9(5) VALUE 0.
01  WS-AREA-2 PIC 9(5) VALUE 0.
01  WS-AREA-1-SIGN PIC S9(5).
01  WS-AREA-2-SIGN PIC S9(5).

PROCEDURE DIVISION.
    ADD 1 TO WS-AREA-1.
    MOVE WS-AREA-1 TO WS-AREA-1-SIGN.
    IF WS-AREA-1-SIGN > 99999 OR WS-AREA-1-SIGN < -99999 THEN
        DISPLAY "Error: WS-AREA-1 overflow"
        GOBACK
    END-IF
    ADD 1 TO WS-AREA-2.
    MOVE WS-AREA-2 TO WS-AREA-2-SIGN.
    IF WS-AREA-2-SIGN > 99999 OR WS-AREA-2-SIGN < -99999 THEN
        DISPLAY "Error: WS-AREA-2 overflow"
        GOBACK
    END-IF
    DISPLAY "WS-AREA-1: " WS-AREA-1 " WS-AREA-2: " WS-AREA-2
    GOBACK.